Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetCoordinateSystem Method
 Returns the coordinate system for the given model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem GetCoordinateSystem()
Public Function GetCoordinateSystem As CoordinateSystem
Return Value
Type: CoordinateSystem
The coordinate system for the given model object.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace